# GetValidUnits Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitUtils..::..GetValidUnits Method
UnitUtils Class See Also
---
Gets the identifiers of all valid units for a given measurable spec.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static IList<ForgeTypeId> GetValidUnits(
	ForgeTypeId specTypeId
)
```

Visual Basic
---
```text
Public Shared Function GetValidUnits ( _
	specTypeId As ForgeTypeId _
) As IList(Of ForgeTypeId)
```

Visual C++
---
```text
public:
static IList<ForgeTypeId^>^ GetValidUnits(
	ForgeTypeId^ specTypeId
)
```

# ### Parameters
specTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId Identifier of the measurable spec.
# ### Return Value
Identifiers of the valid units.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId). |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
UnitUtils Class
Autodesk.Revit.DB Namespace